app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"
---
  def index
    if logged_in?(:site_admin)
      @blogs = Blog.recent.page(params[:page]).per(5)

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "new blog doe"], ["body", "new body doe"], ["created_at", "2018-01-31 18:13:43.166288"], ["updated_at", "2018-01-31 18:13:43.166288"], ["slug", "new-blog-doe"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save