app/controllers/portfolios_controller.rb

  def sort
    params[:order].each do |key, value|
      Portfolio.find(value[:id]).update(position: value[:position])
---
UPDATE "portfolios" SET "position" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["position", 1], ["updated_at", "2018-02-06 00:04:12.884148"], ["id", 1]]