app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios" ORDER BY position ASC
---
  def index
    @portfolio_items = Portfolio.all

INSERT INTO "portfolios" ("title", "subtitle", "body", "main_image", "thumb_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
    @portfolio_item = Portfolio.new(portfolio_params)

    respond_to do |format|
      if @portfolio_item.save

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def set_portfolio_item
    @portfolio_item = Portfolio.find(params[:id])